NetologySlow/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

NetologySlow/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

NetologySlow/src/CommonModules/ЦеныСервер/Module.bsl
//Для использования в Документе, где устанавливаются цены (Документ УстановкаЦен)
//Похоже на код ОбновитьЦеныНаСервере()   в форме элемента Документ.Реализция
//создать экспортную функцию ЦенаНаДату(Номенклатура, Дата), 
//получить запросом срез последних на указанную дату с отбором по номенклатуре и вернуть цену.         
//1. Получить последние цену на указанную дату (создать условие по дате и установить параметр Дата
//2. Отбор по номенклатуре (выборка в Цикле) 
//3. Возврат цены

Функция ЦенаНаДату(Номенклатура, Дата) Экспорт   
	
	Запрос=Новый Запрос ("ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(&Период, ) КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Номенклатура = &Номенклатура");   
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Запрос.УстановитьПараметр("Период",КонецДня(Дата)); 
	
	РезультатЗапроса=Запрос.Выполнить();
	
	Выборка=РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Цена=Выборка.Цена;
	КонецЦикла; 
	
	Возврат Цена; 
	
КонецФункции        

//Для использования в Документе, где устанавливаются скидки (Документ.Реализация)
//Похоже на код ПрименитьСкидку() в форме элемента Документ.Реализция
//получить запросом срез последних на указанную дату с отбором по номенклатуре и номенклатурной группе и 
//вернет скидку, установленную для номенклатурной группы, если нет скидки для конкретной номенклатуры   
//1. Получить последнюю скидку на указанную дату (создать условие по дате и установить параметр Дата
//2. Отбор по номенклатуре и ном. группе (выборка в Цикле)  
//3. Возврат скидки, если нет, то 0

Функция СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата) Экспорт     
	
	Запрос=Новый Запрос ("ВЫБРАТЬ
	|	СкидкиСрезПоследних.Скидка КАК Скидка,
	|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа
	|ПОМЕСТИТЬ ВТ_НоменклатурнаяГруппа
	|ИЗ
	|	РегистрСведений.Скидки.СрезПоследних(
	|			&Период,
	|			НоменклатураНоменклатурнаяГруппа В
	|				(ВЫБРАТЬ
	|					Номенклатура.НоменклатурнаяГруппа.Ссылка КАК Ссылка
	|				ИЗ
	|					Справочник.Номенклатура КАК Номенклатура
	|				ГДЕ
	|					Номенклатура.Ссылка = &НоменклатураНоменклатурнаяГруппа)) КАК СкидкиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатурнаяГруппа.Скидка КАК СкидкаНоменклатурнойГруппы,
	|	ВТ_НоменклатурнаяГруппа.НоменклатураНоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа КАК Номенклатура,
	|	СкидкиСрезПоследних.Скидка КАК СкидкаНоменклатуры
	|ИЗ
	|	ВТ_НоменклатурнаяГруппа КАК ВТ_НоменклатурнаяГруппа
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Скидки.СрезПоследних(&Период, НоменклатураНоменклатурнаяГруппа = &НоменклатураНоменклатурнаяГруппа) КАК СкидкиСрезПоследних
	|		ПО ВТ_НоменклатурнаяГруппа.НоменклатураНоменклатурнаяГруппа = СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа");  
	
	
	
	Запрос.УстановитьПараметр("НоменклатураНоменклатурнаяГруппа", НоменклатураНоменклатурнаяГруппа); 
	Запрос.УстановитьПараметр("Период",КонецДня(Дата)); 
	
	РезультатЗапроса=Запрос.Выполнить();  
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка=РезультатЗапроса.Выбрать();       
		
		Пока Выборка.Следующий() Цикл
			ПроцентСкидки=0; 
			Если ЗначениеЗаполнено(Выборка.СкидкаНоменклатуры) Тогда
				ПроцентСкидки=Выборка.СкидкаНоменклатуры; 
			Иначе 
				ПроцентСкидки=Выборка.СкидкаНоменклатурнойГруппы;  
			КонецЕсли;   
		КонецЦикла;   
		
	КонецЕсли; 
	
	Возврат ПроцентСкидки; 
	
КонецФункции
